/**
 * 36337.js
 *
 * 斗鱼直播间点播平台 https://36337.kuaizhan.com/，无限提交点播电影脚本。
 *
 * 使用————
 *     Chrome打开https://36337.kuaizhan.com/，打开Console
 *     复制下面代码到Console，Enter
 */

var movie = ['野兽', '母亲，爱情的限度', '索多玛120天', '罗马帝国艳情史', '不可撤销', '感官世界', '魔法圣婴', '杀人不分左右', '强我', '切肤之爱', '我唾弃你的坟墓', '拜访者Q', '下水道的美人鱼Q', '迷上瘾', '粉红色的火烈鸟', '春的森林', '爱欲银发世代', '困惑的浪漫', '罗曼史', '地狱解剖', '九首歌', '戏梦巴黎', '姐妹情色', '西西里的美丽传说', '人食人实录', '铁皮鼓', '肉体的恶魔', '午夜守门人', '巴黎最后的探戈', '发条橙', '捆着我，绑着我', '巴黎野玫瑰', '铁男', '欲望号快车', '解放的潘多拉', '天地无伦', '罗宫春色', '神秘马戏团', '纳粹疯淫史', '艳舞女郎', '情迷六月花', '厨师、大盗、他的太太和她的情人', '诱惑：残酷的女人', 'O的故事', '披兽皮的维纳斯', '午夜牛郎', '洛丽塔', '偷窥狂', '甜蜜电影', '肉Flesh', '查泰莱夫人的情人', '上帝创造女人', '欲望号街车', '入谜', '神田川淫乱战争', '教室别恋', '圣兽学园', '恶魔实验', '萨满教的迷恋', '基督最后的诱惑', '维多利亚一号', '人体蜈蚣2', '暴帝卡里古拉', '一个国家的诞生', '意志的胜利', '我好奇之黄', '钢琴女教师', '豚鼠系列', '骑劫地下铁', '教父', '提提卡失序记事', '日落黄沙', '大逃杀', '上海异人娼馆', '安娜情欲史', '艾曼纽', '牧人的性玩偶', '糖果', '天启书', '朗读者', '冷水浴', '欲望酒店', '爱我多深', '三个不道德女人', '唐人街', '露西亚的情人', '与我同眠', '爱情重伤', '乳房与月亮', '云上的日子', '性瘾日记', '定之爱', '在克里奇平静的日子', '马丁的恋情', '不贞的季节', '你妈妈也一样', '睡美人之宅', '孤零飘落燕', '伊米莲', '卖百科全书的女人'];

var i = 0;
setInterval(function(){
    var m = i % 100;
    $('.crow-form-box input').val(movie[m]);
    console.log(movie[m])
    $('#crow-form-submit').trigger('click');
    i++;
}, 1000);